lib/tasks/user_creation_task.rake

  task user_creation: [:environment] do
    User.create!(email: "admin@gmail.com", password: "password", role: 1)
    User.create!(email: "client@gmail.com", password: "password")
---
INSERT INTO "users" ("email", "encrypted_password", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "created_at", "updated_at", "role", "jti") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"